flatPlate/flatPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
        type patch;
        faces
        (
            (3 7 6 2) // this is top side
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (1 5 4 0) // this is bottom side
        );
    }
    leftSide
    {
	type patch; // generic boundary
        faces
        (
            (0 4 7 3) // this is left side
        );
    }
    rightSide
    {
        type patch; // generic boundary
        faces
        (
            (2 6 5 1) // this is right side
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) // z-coordinate = 0
            (4 5 6 7) // z-coorfinate = 0.1
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
